app/controllers/product_data_controller.rb

  def index
    @products = ProductData.all
---
SELECT "product_data".* FROM "product_data"