app/controllers/reports_controller.rb

INSERT INTO "csv_reports" ("created_at", "json_data", "report_file_content_type", "report_file_file_name", "report_file_file_size", "report_file_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "product_data" ("branch", "created_at", "csv_report_id", "price", "product_name", "product_type", "quantity", "throwaway", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    csv_entries = SmarterCSV.process(params[:csv_report][:report_file].tempfile)
    # parses each entry of the data and saves it to the database
    @report = CsvReport.create(:json_data => csv_entries.to_json,
      :report_file => params[:csv_report][:report_file])
    csv_entries.each_with_index do |data, i|
      line_number = i + 1
      p = ProductData.create(:product_name => data[:product_name],
        :product_type => data[:product_type],
        :quantity => data[:quantity],
        :throwaway => data[:throwaway],
        :price => data[:price],
        :branch => data[:branch],
        :csv_report => @report)