app/controllers/report_entries_controller.rb

  def show
    @entry = ReportEntry.find(params[:id])
---
SELECT  "report_entries".* FROM "report_entries"  WHERE "report_entries"."id" = ? LIMIT 1  [["id", 1]]