app/views/report_entries/show.pdf.haml

          %td #{Date.today}
          %td #{@entry.user.last_name} #{@entry.user.first_name}
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]